[
  {
    "name": "Starting the Conversation",
    "host": "Andrey",
    "details": "Let's practice starting low stakes conversations in low pressure environments...",
    "location": "Ada's Technical Books, 425 15th Ave E, Capitol Hill, Seattle, WA",
    "tags": [
      "Communication Skills",
      "Social",
      "Confidence and Self-Esteem",
      "Self-Help & Self-Improvement",
      "Social Skills"
    ],
    "attendees": 40
  },
  {
    "name": "Book Club - Abundance",
    "host": "Ryan",
    "details": "Welcome to the Seattle Intellectual Book Club! The 34th book we are reading is called 'Abundance'...",
    "locaon": "Old Stove Brewing Co — Gardens, 1550 NW 49th St, Capitol Hill, Seattle, WA",
    "tags": [
      "Book Club",
      "Hanging Out",
      "Intellectual Discussions",
      "Personal Development",
      "Social"
    ],
    "attendees": 28
  },
  {
    "name": "Couch Gaming Night @ SiM",
    "host": "Seattle Interactive M.",
    "details": "Every 3rd Wednesday | Come kick back at SiM's monthly Couch Gaming Night...",
    "location": "University District, Seattle, WA",
    "tags": [
      "Arts & Entertainment",
      "Social",
      "Community Building",
      "Multiplayer Gaming",
      "Video Games"
    ],
    "attendees": 5
  },
  {
    "name": "Build with AI ✨🚀 A Tech Summer Party 🏖☀️🦀😎 Pride + Health & Healthcare",
    "host": "Thomas D. and Eloisa E, Google Developer Group (GDG) Bellevue",
    "details": "Celebrating lessons learned and triumphant moments in our open source journey ✨🚀\r\n\r\n♥️ This meetup group is run by 100% volunteers who support the Seattle open source community. ✨ We’re a committed team, pouring our hearts into every event, made possible by the incredible generosity of our sponsors and their in-kind donations.🎗Our meetup group exclusively welcomes in-kind donations and does not accept monetary contributions. Despite our very limited resources, we’re always striving to make each event better than the last! 🥳\r\n\r\n🌷Your reviews truly mean so much—they help us keep uplifting the incredible open source community and secure more in-kind donations!\"\r\n\r\nJoin us and support the open source community! 🥳🌟 In-person event - This is your chance to connect with an extensive open source community with over 50+ Enterprises, Startups and Academia 🌎🚀\r\n\r\nYour network is your fortune. Growing and nurturing your network is one of the most important things you can do for your career ♥️\r\n\r\n🥳 🍬 🍭🍿 An event for our local tech community, with a strong focus on knowledge exchange, networking, and learning 🌟 Get together with:\r\nPyData Seattle | Seattle Spark + AI | PyLadies Seattle |\r\nGoogle Developer Group (GDG) Bellevue / (WTM) Women Techmakers Seattle\r\n\r\nEvent program:\r\n\r\n6:00 PM: Registration & Mingling ♥️ Food: Hamburgers, Fried Chicken, Tamales, Tacos, Cuban Sandwich, Vietnamese Sandwich, Mochi Donuts, and many more surprises! - Donated by Databricks and Delta Lake 🍿🍔 Swag: Google 👩‍🚀💙🚀 💕🌷 🧁🍩\r\n​​6:30 PM: Announcements + Welcome Remarks by:\r\nHonorable MC: Hemie Choi Software Engineer | Game Developer [Looking For Work]\r\n​​6:45 PM ➡️ Session #1:\r\nSpeaker:\r\n​​7:15 PM ➡️ Session #2: LLMs and the quest for AGI - Demo.\r\nSpeaker: Eden D Cohen Product Lead at Google\r\n8:15 PM ➡️ Keynote Talk: Celebrating lessons learned and triumphant moments in our open source journey ✨🚀\r\nKeynote: Javier Luraschi Founder and CEO of **Hal9 **Next Generation AI Platform\r\n​​8:55 PM: Closing Remarks by:\r\nHonorable MC\r\n​​9:00 PM: Good night\r\n♥️ About Databricks\r\n​​Databricks is the data and AI company. More than 10,000 organizations worldwide — including Block, Comcast, Condé Nast, Rivian, Shell and over 60% of the Fortune 500 — rely on the Databricks Data Intelligence Platform to take control of their data and put it to work with AI. Databricks is headquartered in San Francisco, with offices around the globe, and was founded by the original creators of Lakehouse and Apache Spark™.\r\n​​​📚 Check out Tabular has joined Databricks towards a joint vision of the open lakehouse.\r\n​​​📲 Follow Databricks on LinkedIn, X, and Facebook.\r\n​​​🖥️ Subscribe to Databricks YouTube.\r\n​​💾 Sign up for Databricks Express Setup and get $400 free credits when using your work email.\r\n\r\n🚨 Attention\r\n\r\nDue to venue restrictions, please note that children are not permitted. Thank you for your kind understanding.\r\n💟 WiFi: TBD\r\n\r\nWe recommend to arrive early as seats are limited and are first come first serve 🌷🌸🌼\r\n\r\nParking options:\r\n\r\n🚗♥️ There is free parking at Blueprint HQ.\r\nJoin Us at Our Next Event!\r\nhttps://www.meetup.com/bellevue-gdg/events/\r\n\r\n🌷 Our meetup events are made possible thanks to the open source community and a group of volunteers from a diverse background doing the best they can in every event 🌟 Volunteering opportunities - Details here 💟\r\n\r\nSupporting over 13,250+ software engineers and data scientists enthusiasts in the Seattle area 🌷 We provide all our meetup services free of charge thanks to generous sponsors that provide us with in kind donations at every event.\r\n\r\n♥️🌎🚀✨ Call For Proposals 👩‍🚀♥️🌎🚀\r\nWe’re thrilled to invite you to share your ideas with our vibrant meetup community! If you have a 15–45-minute presentation, workshop, or lightning talk, please submit a brief proposal here: Form. 💟 Connect with our chair, Eloisa Elias T , at pydataseattle@gmail.com and complete the form. Join us in creating an inspiring event! 💖 We especially encourage women and first-time speakers to submit proposals for our distinguished tech meetups in Seattle and Bellevue.\r\n\r\n💙 💚 Sponsor the open source community\r\nHost an event at your company or provide some delicious food or snacks for our tech community attending our world class events 🍬 🍭🍿 Please fill out the form here 💟\r\n\r\n💟 Kindly share your highlights and constructive feedback with the organizer regarding Our Open Source Events 💟 form here\r\n\r\n💙🌎 NumFOCUS, 501(c)(3) a nonprofit that supports world-class, innovative, open source scientific projects for Data Science, including: Pandas, NumPy, Julia, SciPy, Sympy, scikit-learn, R project and many more!. NumFOCUS envisions an inclusive scientific and research community that utilizes actively supported open source software to make impactful discoveries for a better world.\r\n\r\n♥️🚀 The Apache Software Foundation - Software for the Public Good\r\nApache Spark is a multi-language engine for executing data engineering, data science, and machine learning on single-node machines or clusters.\r\n\r\nSpark has a thriving open source community, with contributors from around the globe building features, documentation and assisting other users.",
    "location": "Blueprint 2600 116th Ave NE, Bellevue, WA",
    "attendees": 68,
    "tags": [
      "Java",
      "Python",
      "Computer Programming",
      "Mobile Technology",
      "Android Development Operating System"
    ]
  },
  {
    "name": "Introduction to Text Mining (In Person)",
    "host": "UW Libraries",
    "details": "Discover the power of text mining in this interactive workshop, where you will learn techniques for collecting, cleaning, and analyzing textual data through hands-on exercises using Python and Jupyter Notebooks.\r\n\r\nIn this session, you will:\r\n\r\n-Learn methods for scraping and extracting text from web sources.\r\n-Gain skills in preprocessing textual data, such as removing HTML tags, tokenization, and handling stop words.\r\n-Explore techniques for visualizing and analyzing word frequencies to uncover hidden themes and trends.\r\n-Use deep learning models to identify relevant text by analyzing semantic similarity.\r\n\r\nWhen: \tFriday, Jun 27, 2025, 2 – 3 p.m.",
    "location": "University of Washington, Suzzallo Library, Open Scholarship Commons Presentation Space",
    "attendees": 1,
    "tags": [
      "Text mining",
      "Python",
      "Webscraping",
      "workshop",
      "data"
    ]
  },
  {
    "name": "Research Impact Workshop (Online)",
    "host": "UW Libraries",
    "details": "\t\r\nUnderstanding your research impact goes beyond traditional citations. In this workshop, we’ll explore how author profiles help showcase your publications and how altmetrics provide real-time insights into the broader reach of your work. Learn how to track online engagement, connect your research to global conversations, and enhance your visibility using tools like ORCID, Dimensions author profiles, and the Altmetric Bookmarklet. Whether you're looking to strengthen your online presence or demonstrate impact for funding and career opportunities, this session will provide practical strategies to make your research stand out.\r\n\r\nWednesday, Jun 25, 2025, 2 – 3 p.m.",
    "location": "University of Washington, Suzzallo Library",
    "attendees": 1,
    "tags": [
      "Research",
      "Workshop",
      "Publications"
    ]
  },
  {
    "name": "Personal Privacy & Your Phone",
    "host": "UW Libraries",
    "details": "If you're thinking about your digital privacy, then you know that your phone is probably not very private. In this hands-on workshop, we'll help you assess what information your phone is leaking, think through what steps you can take to plug up the leaks without losing functionality, and spend some time adjusting settings and apps to be more privacy-friendly.\r\n\r\nPart of 2025 UW Libraries \"Most Wanted\" Summer Series\r\n\r\nWhen: \tTuesday, Jun 24, 2025, 2 – 3 p.m.",
    "location": "University of Washington, Suzzallo Library, Open Scholarship Commons Presentation Space",
    "attendees": 1,
    "tags": [
      "Workshop",
      "Personal Privacy",
      "Phone",
      "Hands-on"
    ]
  }
]